{"modelTopology": {"keras_version": "2.1.6", "model_config": {"class_name": "Model", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"name": "input_1", "dtype": "float32", "batch_input_shape": [null, null, null, 3], "sparse": false}}, {"class_name": "Conv2D", "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"activation": "linear", "dilation_rate": [1, 1], "filters": 16, "name": "conv2d_1", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "padding": "same", "strides": [1, 1], "use_bias": false, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"gamma_constraint": null, "name": "batch_normalization_1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"name": "leaky_re_lu_1", "alpha": 0.10000000149011612, "trainable": true}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_1", "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]], "config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last", "padding": "same", "strides": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_2", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"activation": "linear", "dilation_rate": [1, 1], "filters": 32, "name": "conv2d_2", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "padding": "same", "strides": [1, 1], "use_bias": false, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"gamma_constraint": null, "name": "batch_normalization_2", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"name": "leaky_re_lu_2", "alpha": 0.10000000149011612, "trainable": true}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2", "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]], "config": {"pool_size": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last", "padding": "same", "strides": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_3", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"activation": "linear", "dilation_rate": [1, 1], "filters": 64, "name": "conv2d_3", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "padding": "same", "strides": [1, 1], "use_bias": false, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"gamma_constraint": null, "name": "batch_normalization_3", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"name": "leaky_re_lu_3", "alpha": 0.10000000149011612, "trainable": true}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_3", "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]], "config": {"pool_size": [2, 2], "name": "max_pooling2d_3", "data_format": "channels_last", "padding": "same", "strides": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_4", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "config": {"activation": "linear", "dilation_rate": [1, 1], "filters": 128, "name": "conv2d_4", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "padding": "same", "strides": [1, 1], "use_bias": false, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"gamma_constraint": null, "name": "batch_normalization_4", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"name": "leaky_re_lu_4", "alpha": 0.10000000149011612, "trainable": true}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_4", "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]], "config": {"pool_size": [2, 2], "name": "max_pooling2d_4", "data_format": "channels_last", "padding": "same", "strides": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_5", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "config": {"activation": "linear", "dilation_rate": [1, 1], "filters": 256, "name": "conv2d_5", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "padding": "same", "strides": [1, 1], "use_bias": false, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"gamma_constraint": null, "name": "batch_normalization_5", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "config": {"name": "leaky_re_lu_5", "alpha": 0.10000000149011612, "trainable": true}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_5", "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]], "config": {"pool_size": [2, 2], "name": "max_pooling2d_5", "data_format": "channels_last", "padding": "same", "strides": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_6", "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]], "config": {"activation": "linear", "dilation_rate": [1, 1], "filters": 512, "name": "conv2d_6", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "padding": "same", "strides": [1, 1], "use_bias": false, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"gamma_constraint": null, "name": "batch_normalization_6", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "config": {"name": "leaky_re_lu_6", "alpha": 0.10000000149011612, "trainable": true}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_6", "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]], "config": {"pool_size": [2, 2], "name": "max_pooling2d_6", "data_format": "channels_last", "padding": "same", "strides": [1, 1], "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_7", "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]], "config": {"activation": "linear", "dilation_rate": [1, 1], "filters": 1024, "name": "conv2d_7", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "padding": "same", "strides": [1, 1], "use_bias": false, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"gamma_constraint": null, "name": "batch_normalization_7", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "config": {"name": "leaky_re_lu_7", "alpha": 0.10000000149011612, "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_8", "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}]]], "config": {"activation": "linear", "dilation_rate": [1, 1], "filters": 256, "name": "conv2d_8", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "padding": "same", "strides": [1, 1], "use_bias": false, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"gamma_constraint": null, "name": "batch_normalization_8", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "config": {"name": "leaky_re_lu_8", "alpha": 0.10000000149011612, "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_11", "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]], "config": {"activation": "linear", "dilation_rate": [1, 1], "filters": 128, "name": "conv2d_11", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "padding": "same", "strides": [1, 1], "use_bias": false, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_10", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "config": {"gamma_constraint": null, "name": "batch_normalization_10", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_10", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "config": {"name": "leaky_re_lu_10", "alpha": 0.10000000149011612, "trainable": true}}, {"class_name": "UpSampling2D", "name": "up_sampling2d_1", "inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}]]], "config": {"name": "up_sampling2d_1", "size": [2, 2], "trainable": true, "data_format": "channels_last"}}, {"class_name": "Concatenate", "name": "concatenate_1", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}], ["leaky_re_lu_5", 0, 0, {}]]], "config": {"name": "concatenate_1", "axis": -1, "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_9", "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]], "config": {"activation": "linear", "dilation_rate": [1, 1], "filters": 512, "name": "conv2d_9", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "padding": "same", "strides": [1, 1], "use_bias": false, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Conv2D", "name": "conv2d_12", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"activation": "linear", "dilation_rate": [1, 1], "filters": 256, "name": "conv2d_12", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "padding": "same", "strides": [1, 1], "use_bias": false, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_9", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"gamma_constraint": null, "name": "batch_normalization_9", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true}}, {"class_name": "BatchNormalization", "name": "batch_normalization_11", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "config": {"gamma_constraint": null, "name": "batch_normalization_11", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_9", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "config": {"name": "leaky_re_lu_9", "alpha": 0.10000000149011612, "trainable": true}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_11", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "config": {"name": "leaky_re_lu_11", "alpha": 0.10000000149011612, "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_10", "inbound_nodes": [[["leaky_re_lu_9", 0, 0, {}]]], "config": {"activation": "linear", "dilation_rate": [1, 1], "filters": 18, "name": "conv2d_10", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "padding": "same", "strides": [1, 1], "use_bias": true, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Conv2D", "name": "conv2d_13", "inbound_nodes": [[["leaky_re_lu_11", 0, 0, {}]]], "config": {"activation": "linear", "dilation_rate": [1, 1], "filters": 18, "name": "conv2d_13", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "padding": "same", "strides": [1, 1], "use_bias": true, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "activity_regularizer": null, "kernel_constraint": null}}], "output_layers": [["conv2d_10", 0, 0], ["conv2d_13", 0, 0]], "input_layers": [["input_1", 0, 0]]}}, "backend": "tensorflow"}, "weightsManifest": [{"weights": [{"name": "batch_normalization_1/gamma", "dtype": "float32", "shape": [16]}, {"name": "batch_normalization_1/beta", "dtype": "float32", "shape": [16]}, {"name": "batch_normalization_1/moving_mean", "dtype": "float32", "shape": [16]}, {"name": "batch_normalization_1/moving_variance", "dtype": "float32", "shape": [16]}, {"name": "batch_normalization_10/gamma", "dtype": "float32", "shape": [128]}, {"name": "batch_normalization_10/beta", "dtype": "float32", "shape": [128]}, {"name": "batch_normalization_10/moving_mean", "dtype": "float32", "shape": [128]}, {"name": "batch_normalization_10/moving_variance", "dtype": "float32", "shape": [128]}, {"name": "batch_normalization_11/gamma", "dtype": "float32", "shape": [256]}, {"name": "batch_normalization_11/beta", "dtype": "float32", "shape": [256]}, {"name": "batch_normalization_11/moving_mean", "dtype": "float32", "shape": [256]}, {"name": "batch_normalization_11/moving_variance", "dtype": "float32", "shape": [256]}, {"name": "batch_normalization_2/gamma", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_2/beta", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_2/moving_mean", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_2/moving_variance", "dtype": "float32", "shape": [32]}, {"name": "batch_normalization_3/gamma", "dtype": "float32", "shape": [64]}, {"name": "batch_normalization_3/beta", "dtype": "float32", "shape": [64]}, {"name": "batch_normalization_3/moving_mean", "dtype": "float32", "shape": [64]}, {"name": "batch_normalization_3/moving_variance", "dtype": "float32", "shape": [64]}, {"name": "batch_normalization_4/gamma", "dtype": "float32", "shape": [128]}, {"name": "batch_normalization_4/beta", "dtype": "float32", "shape": [128]}, {"name": "batch_normalization_4/moving_mean", "dtype": "float32", "shape": [128]}, {"name": "batch_normalization_4/moving_variance", "dtype": "float32", "shape": [128]}, {"name": "batch_normalization_5/gamma", "dtype": "float32", "shape": [256]}, {"name": "batch_normalization_5/beta", "dtype": "float32", "shape": [256]}, {"name": "batch_normalization_5/moving_mean", "dtype": "float32", "shape": [256]}, {"name": "batch_normalization_5/moving_variance", "dtype": "float32", "shape": [256]}, {"name": "batch_normalization_6/gamma", "dtype": "float32", "shape": [512]}, {"name": "batch_normalization_6/beta", "dtype": "float32", "shape": [512]}, {"name": "batch_normalization_6/moving_mean", "dtype": "float32", "shape": [512]}, {"name": "batch_normalization_6/moving_variance", "dtype": "float32", "shape": [512]}, {"name": "batch_normalization_7/gamma", "dtype": "float32", "shape": [1024]}, {"name": "batch_normalization_7/beta", "dtype": "float32", "shape": [1024]}, {"name": "batch_normalization_7/moving_mean", "dtype": "float32", "shape": [1024]}, {"name": "batch_normalization_7/moving_variance", "dtype": "float32", "shape": [1024]}, {"name": "batch_normalization_8/gamma", "dtype": "float32", "shape": [256]}, {"name": "batch_normalization_8/beta", "dtype": "float32", "shape": [256]}, {"name": "batch_normalization_8/moving_mean", "dtype": "float32", "shape": [256]}, {"name": "batch_normalization_8/moving_variance", "dtype": "float32", "shape": [256]}, {"name": "batch_normalization_9/gamma", "dtype": "float32", "shape": [512]}, {"name": "batch_normalization_9/beta", "dtype": "float32", "shape": [512]}, {"name": "batch_normalization_9/moving_mean", "dtype": "float32", "shape": [512]}, {"name": "batch_normalization_9/moving_variance", "dtype": "float32", "shape": [512]}, {"name": "conv2d_1/kernel", "dtype": "float32", "shape": [3, 3, 3, 16]}, {"name": "conv2d_10/kernel", "dtype": "float32", "shape": [1, 1, 512, 18]}, {"name": "conv2d_10/bias", "dtype": "float32", "shape": [18]}, {"name": "conv2d_11/kernel", "dtype": "float32", "shape": [1, 1, 256, 128]}, {"name": "conv2d_12/kernel", "dtype": "float32", "shape": [3, 3, 384, 256]}, {"name": "conv2d_13/kernel", "dtype": "float32", "shape": [1, 1, 256, 18]}, {"name": "conv2d_13/bias", "dtype": "float32", "shape": [18]}, {"name": "conv2d_2/kernel", "dtype": "float32", "shape": [3, 3, 16, 32]}, {"name": "conv2d_3/kernel", "dtype": "float32", "shape": [3, 3, 32, 64]}, {"name": "conv2d_4/kernel", "dtype": "float32", "shape": [3, 3, 64, 128]}, {"name": "conv2d_5/kernel", "dtype": "float32", "shape": [3, 3, 128, 256]}, {"name": "conv2d_6/kernel", "dtype": "float32", "shape": [3, 3, 256, 512]}, {"name": "conv2d_7/kernel", "dtype": "float32", "shape": [3, 3, 512, 1024]}, {"name": "conv2d_8/kernel", "dtype": "float32", "shape": [1, 1, 1024, 256]}, {"name": "conv2d_9/kernel", "dtype": "float32", "shape": [3, 3, 256, 512]}], "paths": ["group1-shard1of9", "group1-shard2of9", "group1-shard3of9", "group1-shard4of9", "group1-shard5of9", "group1-shard6of9", "group1-shard7of9", "group1-shard8of9", "group1-shard9of9"]}]}